{
    "1": {
      "title": "Simulation: Supporting Jamie (Student with Dyslexia) in a Fraction Word Problem",
      "conversation": [
        {
          "speaker": "Tutor",
          "text": "Hi Jamie! I noticed your answer used 3 smoothies, but the question says 4. Let’s take another look together."
        },
        {
          "speaker": "Jamie",
          "text": "Oh… I thought it said 3 smoothies. I must have read it wrong."
        },
        {
          "speaker": "Tutor",
          "text": "That’s okay! Word problems can be tricky, especially when numbers are mixed in with a lot of text. One thing that helps is underlining key information. Let’s try that now."
        },
        {
          "speaker": "Jamie",
          "text": "Okay. I see it now—it says 4 smoothies, not 3."
        },
        {
          "speaker": "Tutor",
          "text": "Great! Now, each smoothie needs 2/3 cup of milk. What should we do if we’re making 4 of them?"
        },
        {
          "speaker": "Jamie",
          "text": "Multiply 4 by 2/3?"
        },
        {
          "speaker": "Tutor",
          "text": "Exactly! Let's solve that together. What do we get when we multiply 4 times 2?"
        },
        {
          "speaker": "Jamie",
          "text": "That’s 8. So it’s 8 over 3?"
        },
        {
          "speaker": "Tutor",
          "text": "You got it! 8/3 is the answer in improper fraction form. Can we turn that into a mixed number?"
        },
        {
          "speaker": "Jamie",
          "text": "3 goes into 8 two times with 2 left over, so it’s 2 and 2/3 cups!"
        },
        {
          "speaker": "Tutor",
          "text": "Well done, Jamie! Underlining numbers really helped. Keep using that trick when reading word problems!"
        }
      ],
      "disability": "Dyslexia",
      "problem": "Each smoothie needs 2/3 cup of milk. Sam wants to make 4 smoothies. How much milk does he need in total?"
    },
    "2": {
      "title": "Simulation: Supporting Riley (Student with Dysgraphia) in a Fraction Problem",
      "conversation": [
        {
          "speaker": "Tutor",
          "text": "Hi Riley! I see you’ve written your work here—let’s take a look together."
        },
        {
          "speaker": "Riley",
          "text": "Sorry, it’s really messy… I kept losing track of the numbers."
        },
        {
          "speaker": "Tutor",
          "text": "No worries at all. That’s totally okay. Let’s go through it step by step. The question says each smoothie needs 2/3 cup of milk and you’re making 4 smoothies. What do you think we need to do?"
        },
        {
          "speaker": "Riley",
          "text": "Um… I think I started adding 2/3 four times, but I got confused writing the fractions. They kept getting jumbled."
        },
        {
          "speaker": "Tutor",
          "text": "That makes sense. Writing fractions neatly can be tricky, especially if spacing is tight or numbers shift around. Want to try using colored blocks or typing it out instead?"
        },
        {
          "speaker": "Riley",
          "text": "Yeah, maybe typing would help. My hand gets tired fast too."
        },
        {
          "speaker": "Tutor",
          "text": "Great idea. Now, let’s talk it out. If we do 4 × 2/3, what’s 4 times 2?"
        },
        {
          "speaker": "Riley",
          "text": "That’s 8. So it’s 8 over 3?"
        },
        {
          "speaker": "Tutor",
          "text": "Exactly! 8/3. Can you say what that is as a mixed number?"
        },
        {
          "speaker": "Riley",
          "text": "3 goes into 8 twice, with 2 left. So it’s 2 and 2/3 cups."
        },
        {
          "speaker": "Tutor",
          "text": "Perfect! You understood the problem really well. Let’s use assistive tools next time so your writing doesn’t get in the way of showing what you know."
        }
      ],
      "disability": "Dysgraphia",
      "problem": "Each smoothie needs 2/3 cup of milk. Sam wants to make 4 smoothies. How much milk does he need in total?"
    },
  "3":{
    "title": "Simulation: Supporting Ken (Student with Dyscalculia) in a Fraction Problem",
    "conversation": [
      {
        "speaker": "Tutor",
        "text": "Hey Ken! Let’s look at the smoothie problem together. I see you wrote down 5 cups of milk. Can you walk me through your thinking?"
      },
      {
        "speaker": "Ken",
        "text": "Yeah… I saw 2 and 3 in the fraction, so I just added them to get 5. Then I thought that’s how much milk I need."
      },
      {
        "speaker": "Tutor",
        "text": "Thanks for explaining. I really like that you're trying to work with the numbers! That fraction, 2/3, is actually one amount — two-thirds of a cup. Not 2 and 3 separately."
      },
      {
        "speaker": "Ken",
        "text": "Oh… I thought it meant both 2 and 3 separately. Fractions are confusing."
      },
      {
        "speaker": "Tutor",
        "text": "They can be, but we’ll get through it together. Imagine 4 smoothies, each needing 2/3 cup. That means we’re repeating 2/3 four times. That’s multiplication."
      },
      {
        "speaker": "Ken",
        "text": "So… instead of adding 2 and 3, I should do 4 times 2/3?"
      },
      {
        "speaker": "Tutor",
        "text": "Exactly! Let’s multiply it: 4 times 2 is 8, and the denominator stays 3. That gives us 8/3."
      },
      {
        "speaker": "Ken",
        "text": "Okay, 8/3. That’s more than 2… so it’s 2 and… 2/3?"
      },
      {
        "speaker": "Tutor",
        "text": "Perfect! 2 and 2/3 cups of milk. And next time you see a fraction, remember — it’s one number showing part of a whole, not two pieces to be added."
      },
      {
        "speaker": "Ken",
        "text": "Thanks! That actually makes more sense now. I’ll try to remember that."
      }
    ],
    "disability": "Dyscalculia",
    "problem": "Each smoothie needs 2/3 cup of milk. Sam wants to make 4 smoothies. How much milk does he need in total?"
  },
  "4": {
    "title": "Simulation: Supporting Jordan (Student with ADHD) in a Fraction Problem",
    "conversation": [
      {
        "speaker": "Tutor",
        "text": "Hey Jordan! I noticed your answer says 3 cups. Want to walk me through how you got that?"
      },
      {
        "speaker": "Jordan",
        "text": "Um… I think I was adding 2/3, then I got distracted and forgot if I had 3 or 4 smoothies. So I just guessed."
      },
      {
        "speaker": "Tutor",
        "text": "Thanks for being honest! That’s totally okay. Let’s take it one small step at a time. The problem says: 4 smoothies, and each needs 2/3 cup of milk. What’s the first thing we can do?"
      },
      {
        "speaker": "Jordan",
        "text": "We… repeat 2/3 four times?"
      },
      {
        "speaker": "Tutor",
        "text": "Yes! And repeating the same number is the same as multiplying. So what’s 4 times 2?"
      },
      {
        "speaker": "Jordan",
        "text": "That’s 8. So the answer is 8 over 3?"
      },
      {
        "speaker": "Tutor",
        "text": "Exactly! Now let’s finish strong—how many times does 3 go into 8?"
      },
      {
        "speaker": "Jordan",
        "text": "Twice, with 2 left over. So it’s 2 and 2/3?"
      },
      {
        "speaker": "Tutor",
        "text": "Nailed it! You stayed focused and worked through each step. Try using a checklist or even a finger tap for each part next time—that can help keep track."
      },
      {
        "speaker": "Jordan",
        "text": "Yeah, that helped. When I go step-by-step, I don’t get as overwhelmed."
      }
    ],
    "disability": "ADHD",
    "problem": "Each smoothie needs 2/3 cup of milk. Sam wants to make 4 smoothies. How much milk does he need in total?"
  },
  "5": {
    "title": "Simulation: Supporting Maya (Student with Auditory Processing Disorder) in a Fraction Problem",
    "conversation": [
      {
        "speaker": "Tutor",
        "text": "Hi Maya! Let's go over this problem together. The question is: Each smoothie needs 2/3 cup of milk. If Sam wants to make 4 smoothies, how much milk will he need in total?"
      },
      {
        "speaker": "Maya",
        "text": "...Wait—did you say 2 cups for 3 smoothies?"
      },
      {
        "speaker": "Tutor",
        "text": "Ah, not quite. Let me slow it down and repeat it clearly: Each smoothie needs two-thirds of a cup of milk. Sam wants to make four smoothies. How much milk does he need?"
      },
      {
        "speaker": "Maya",
        "text": "Okay, two-thirds for each… and there are four… smoothies?"
      },
      {
        "speaker": "Tutor",
        "text": "Yes, perfect! Now, we’re using the same amount—two-thirds—four times. What operation do you think that is?"
      },
      {
        "speaker": "Maya",
        "text": "Is it multiplication? Like 4 × 2/3?"
      },
      {
        "speaker": "Tutor",
        "text": "Exactly! And 4 times 2 is?"
      },
      {
        "speaker": "Maya",
        "text": "8. So that’s 8/3?"
      },
      {
        "speaker": "Tutor",
        "text": "Right again. Can you turn 8/3 into a mixed number?"
      },
      {
        "speaker": "Maya",
        "text": "3 goes into 8 two times, with 2 left. So, 2 and 2/3."
      },
      {
        "speaker": "Tutor",
        "text": "Great work, Maya! And if anything I say is ever unclear, it’s always okay to ask me to slow down or repeat it. You're doing an amazing job!"
      }
    ],
    "disability": "Auditory Processing Disorder (APD)",
    "problem": "Each smoothie needs 2/3 cup of milk. Sam wants to make 4 smoothies. How much milk does he need in total?"
  },
  "6":{
    "title": "Simulation: Supporting Eli (Student with Nonverbal Learning Disorder) in a Fraction Problem",
    "conversation": [
      {
        "speaker": "Tutor",
        "text": "Hey Eli! I saw your answer said 4/2 cups of milk. Want to share how you got that?"
      },
      {
        "speaker": "Eli",
        "text": "I tried putting the 4 and 2 together… but I wasn’t sure where the numbers go in the fraction. It’s hard to picture it."
      },
      {
        "speaker": "Tutor",
        "text": "Thanks for telling me that. Fractions can be hard to visualize, especially when they involve multiple steps. Want to try breaking it down using words instead of pictures?"
      },
      {
        "speaker": "Eli",
        "text": "Yeah, I do better with words."
      },
      {
        "speaker": "Tutor",
        "text": "Alright, the question says: Each smoothie needs 2/3 cup of milk. If you're making 4 smoothies, you’ll need 2/3 cup four times. That means we multiply 4 × 2/3. What’s 4 times 2?"
      },
      {
        "speaker": "Eli",
        "text": "That’s 8. So we put that over 3?"
      },
      {
        "speaker": "Tutor",
        "text": "Exactly—8/3. Now, if we want to turn 8/3 into a regular number, how many times does 3 go into 8?"
      },
      {
        "speaker": "Eli",
        "text": "Twice, with 2 leftover. So… 2 and 2/3?"
      },
      {
        "speaker": "Tutor",
        "text": "Yes! That’s the total milk you’d need. You really nailed it when we focused on the words and steps instead of the shapes or diagrams."
      },
      {
        "speaker": "Eli",
        "text": "Yeah, it helps when I don’t have to imagine stuff like that. I understand better when we just talk through it."
      }
    ],
    "disability": "Nonverbal Learning Disorder (NVLD)",
    "problem": "Each smoothie needs 2/3 cup of milk. Sam wants to make 4 smoothies. How much milk does he need in total?"
  },
  "7": {
    "title": "Simulation: Supporting Nora (Student with Language Processing Disorder) in a Fraction Problem",
    "conversation": [
      {
        "speaker": "Tutor",
        "text": "Hey Nora! Let’s read this problem together: Each smoothie needs 2/3 cup of milk. If Sam wants to make 4 smoothies, how much milk does he need?"
      },
      {
        "speaker": "Nora",
        "text": "...Wait. What do you mean by 'each' smoothie? I’m not sure what that means."
      },
      {
        "speaker": "Tutor",
        "text": "Great question. ‘Each’ means every one. So, if Sam makes one smoothie, he needs 2/3 cup of milk. If he makes four, we need to figure out how much milk he needs total."
      },
      {
        "speaker": "Nora",
        "text": "Oh… okay. So, we have 2/3 four times?"
      },
      {
        "speaker": "Tutor",
        "text": "Exactly. That’s multiplication. When we have the same amount repeated, like 2/3 four times, we can multiply 4 × 2/3."
      },
      {
        "speaker": "Nora",
        "text": "So, 4 times 2 is 8… then I keep the 3 on the bottom?"
      },
      {
        "speaker": "Tutor",
        "text": "Yes! That gives us 8/3. Now we’ll change that into a mixed number. How many times does 3 go into 8?"
      },
      {
        "speaker": "Nora",
        "text": "Two times, and there’s 2 left. So… 2 and 2/3?"
      },
      {
        "speaker": "Tutor",
        "text": "Perfect! If any part of a question is confusing, it’s always okay to ask. Understanding what the question says is just as important as doing the math!"
      },
      {
        "speaker": "Nora",
        "text": "Thanks. I feel better when you explain the words step by step like that."
      }
    ],
    "disability": "Language Processing Disorder (LPD)",
    "problem": "Each smoothie needs 2/3 cup of milk. Sam wants to make 4 smoothies. How much milk does he need in total?"
  }  
}
  